---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.UnusedSlopeArrow
source: html/a5a61aea-455f-eb3d-bdea-4eb76ccf3f12.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.UnusedSlopeArrow Property

The tails of all slope arrows must lie on the roof boundary.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnusedSlopeArrow { get; }
```